[["Database","DGET",
  "Extracts a single record from a list or database than meets the criteria."],
 ["Date and Time","WEEKDAY",
  "Returns the day of the week from a date as an integer (with Sunday=1). "],
 ["Maths And Trigonometry","SIN",
  "Returns the sine of an angle expressed as radians."],
 ["Database","DAVERAGE",
  "Averages the values in a field (column) of records in a list or database that match conditions you specify."],
 ["Date and Time","SECOND","Returns the seconds value from a time value."],
 ["Information","ISERROR",
  "Checks whether a cell value is an error and returns TRUE or FALSE"],
 ["Maths And Trigonometry","POWER",
  "Returns the result of a number raised by a specified power."],
 ["Financial","SYD",
  "Returns the sum-of-years' digits depreciation of an asset for a specified period."],
 ["Maths And Trigonometry","MOD",
  "Returns the remainder of a number divided by another number."],
 ["Statistical","MIN","Returns the smallest value in a range of values."],
 ["Financial","PV","Returns the present value of an investment."],
 ["Logical","NOT","Changes logical value e.g. From FALSE to TRUE"],
 ["Statistical","COUNTBLANK","Counts the number of empty cells."],
 ["Logical","AND",
  "Returns true if all the logic arguments supplied evaluate to TRUE. "],
 ["Statistical","AVERAGE","Returns the average of a range of numbers"],
 ["Text","PROPER","Capitalises the first letter in a text string."],
 ["Truncation","INT","Rounds a number down to the nearest integer value."],
 ["Information","ISTEXT",
  "Checks whether a cell value is text and returns TRUE or FALSE"],
 ["Maths And Trigonometry","ACOS",
  "Returns the arccosine of a number between -1 and 1. The arccosine is the angle whose cosine is the number. The angle is given in radians from 0 to pi. "],
 ["Text","UPPER","Converts text to uppercase."],
 ["Text","LEN","Returns the length (number of characters) in a string."],
 ["Lookup and Reference","ROWS",
  "Returns the number of rows in an array/range."],
 ["Text","SUBSTITUTE","Substitutes new for old text in a text string."],
 ["Text","EXACT",
  "Compares two text strings and returns TRUE if they are an exact match or FALSE otherwise."],
 ["Date and Time","MINUTE","Returns the minute value from a time value."],
 ["Lookup and Reference","HLOOKUP",
  "Searches for a value in the top row of an array and returns the value in the row specified to get the value from."],
 ["Hypernumbers","TEXTAREA","Create a textarea"],
 ["Date and Time","DATE",
  "Returns the internal software serial number of a date.&nbsp;"],
 ["Financial","RATE","Caculates the interest rate per period for an annuity."],
 ["Logical","true","Returns the logical value of TRUE."],
 ["Logical","OR",
  "Returns TRUE if any of the logic arguments supplied evaluate to TRUE. Otherwise FALSE."],
 ["Maths And Trigonometry","LN",
  "Returns the natural (base e) logarithm of a number."],
 ["Statistical","COUNTIF",
  "Counts the number of cells in a range that meet a given condition."],
 ["Hypernumbers","INCLUDE","Includes the range as rendered html"],
 ["Database","DSUM","Calculates the sum of values for a field in a database."],
 ["Financial","NPER",
  "Returns the number of periods for an investment based on periodic constant payments and interest rate."],
 ["Logical","false","Retuns a logical value of FALSE."],
 ["Maths And Trigonometry","DEGREES","Converts radians to degrees."],
 ["Statistical","COUNT","Counts the number of cells with numbers."],
 ["Text","REPLACE",
  "Replaces part of a text string with the specified characters."],
 ["Truncation","TRUNC",
  "Truncates a number to a specified number of decimal places."],
 ["Truncation","ROUND","Rounds a number to the specified round-off unit."],
 ["Database","DMIN",
  "Returns the minimum value in a field (column) of records in a list or database that match conditions you specify."],
 ["Financial","DDB","Returns the depreceiation of an asset."],
 ["Information","N","Converts non-number values to numbers"],
 ["Maths And Trigonometry","SUM",
  "calculates the sum of all the numbers specified."],
 ["Maths And Trigonometry","ATAN",
  "Returns the arctangent of a number. The arctangent is the angle whose tangent is the number. The angle is given in radians from -pi/2 to pi/2. "],
 ["Text","VALUE",
  "Converts a text string that represents a number to a number."],
 ["Text","LOWER","Converts all characters in a string to lower case."],
 ["Database","DCOUNTA",
  "Counts the number of non-blank records in a list or database that match conditions you specify."],
 ["Date and Time","TODAY","Todays date."],
 ["Information","ISNONTEXT",
  "Checks whether a value is not text and returns TRUE or FALSE"],
 ["Information","ISNA",
  "Checks whether a value is #N/A and returns TRUE or FALSE"],
 ["Lookup and Reference","VLOOKUP",
  "Searches for a value in the leftmost column of an array and returns the value in the column specified to get the value from."],
 ["Maths And Trigonometry","RADIANS","Converts degrees to radians."],
 ["Text","T","Returns the value of the referenced cell."],
 ["Text","FIND","Returns the position of a character in a string."],
 ["category","function","help"],
 ["Date and Time","MONTH","Returns the month value from a date value."],
 ["Information","ISERR",
  "Checks whether a cell value is an error and returns TRUE or FALSE"],
 ["Lookup and Reference","INDEX",
  "Returns a value from within an array at the position specified by a row and column number."],
 ["Maths And Trigonometry","PI","Returns the constant PI."],
 ["Statistical","VAR",
  "Calculates the variance of a sample of numbers around the mean. Uses n-1 as the divisor."],
 ["Statistical","STDEVP",
  "Calculates the standard deviation or dispersion measure of a set of values around the mean. Uses n as the divisor."],
 ["Text","REPT","Repeat text a specified number of times."],
 ["Hypernumbers","SELECT","Create a drop down select box"],
 ["Date and Time","DAY","Returns the day of the month from a date."],
 ["Financial","SLN",
  "Returns the straight-line depreciation of an asset for one period."],
 ["Lookup and Reference","CHOOSE",
  "Uses an index number to select from a list of values."],
 ["Maths And Trigonometry","LOG",
  "Returns the logarithm of a number for any specified base."],
 ["Statistical","MAX","Returns the largest value in a range of values."],
 ["Hypernumbers","INPUT","Create a single line text input"],
 ["Database","DVAR",
  "Estimates the variance for a field in a sample from a database."],
 ["Financial","PMT",
  "Calculates the payment amount for a loan over a number of periods at a fixed interest rate."],
 ["Financial","NPV",
  "Calculates the net present value of an investment by using a discount rate and a series of future payments (negative values) and income (positive values)."],
 ["Logical","IF","Use conditional logic in calculations."],
 ["Maths And Trigonometry","EXP",
  "Exponetial of a number is e (=2.71828182845905) raised to the power of the input number. "],
 ["Statistical","COUNTA","Counts the number of cells that are not empty."],
 ["Hypernumbers","TWITTER.BUTTON",
  "Embed a twitter \"follow me\" button onto your page, name is your username, x is optional and a number from 0-5 which changes the style of the button"],
 ["Database","DPRODUCT",
  "Multiplies the values in a field that meets certain criteria."],
 ["Financial","FV","Returns the future value of an investment."],
 ["Information","NA","Returns (value not available) #N/A"],
 ["Maths And Trigonometry","TAN",
  "Returns the tangent of an angle - entered as radians."],
 ["Maths And Trigonometry","SUMIF",
  "Returns the sum of numbers in a range of cells that satisfy a specified criteria. For example =SUMIF(a1:a4, \">2\") will sum up the values in a1:a4 only where the cell is >2. The cells to be summed can be from a different range."],
 ["Maths And Trigonometry","ATAN2",
  "Returns the arctangent or angle between the x-axis and a line extending from the origin to some (x,y) coordinates. The angle is given in radians from -pi to pi. "],
 ["Text","MID","Extracts a substring from a larger string."],
 ["Truncation","EVEN","Returns number up to the nearest even integer. "],
 ["Information","ISNUMBER",
  "Checks whether a cell value is a number and returns TRUE or FALSE"],
 ["Maths And Trigonometry","ABS","Returns the absolute value of a number."],
 ["Text","TRIM",
  "Removes spaces from text except for single spacing between words."],
 ["Text","LEFT",
  "Extracts the left most characters in a string specified by num_chars. The default is the leftmost character if num_chars is omitted."],
 ["Date and Time","NOW",[]],
 ["Lookup and Reference",[],
  "Returns the relative position of a value in a range of values."],
 ["Statistical","VARP",
  "Calculates the variance of a sample of numbers around the mean. Uses n as the divisor."],
 ["Text","RIGHT",
  "Returns the rightmost non-missing characters from a text string given the number of characters required."],
 ["Hypernumbers","RADIO","Create a set of radio buttons"],
 ["Date and Time","HOUR","Returns the hour of a time value."],
 ["Lookup and Reference","COLUMNS",
  "Ruturns the number of columns in an array/range."],
 ["Maths And Trigonometry","LOG10",
  "Returns the logarithm to base 10 of a number."],
 ["Hypernumbers","BUTTON","Create a button with its value set to text"],
 ["Database","DVARP","Estimates the variance for a field in a database."],
 ["Maths And Trigonometry","FACT",
  "Returns factorial of a number. E.g. Fact(4)=4*3*2*1=24."],
 ["Hypernumbers","GOOGLE.MAP",
  "Embed a google map that centers at Latitude, Longitude, the zoom level is a number between 1 and 20. (the map will preview as an image inside the spreadsheet)"],
 ["Database","DSTDEVP",
  "Calculates the standard deviation for a field in a sample from a database."],
 ["Database","DSTDEV",
  "Calculates the standard deviation for a field in a database."],
 ["Financial","IRR",
  "returns tyhe internal rate of return for a series of cash flows."],
 ["Maths And Trigonometry","COS",
  "Returns the cosine of an angle - supplied as radians."],
 ["Database","DMAX",
  "Returns the maximum value in a field (column) of records in a list or database that match conditions you specify."],
 ["Date and Time","YEAR","Returns the year value for a given date."],
 ["Maths And Trigonometry","SQRT",
  "Returns the square root of a number. For info =SQRT(4) is equivalent to using =4^0.5 or power(4,0.5)."],
 ["Maths And Trigonometry","ASIN",
  "Returns the arcsine of a number between -1 and 1. The arcsine is the angle whose sine is the number. The angle is given in radians from -pi/2 to pi/2. "],
 ["Database","DCOUNT",
  "Counts the number of values in a list or database that match conditions you specify."],
 ["Date and Time","TIME",
  "Returns the decimal fraction of days time in terms of 24 hours."],
 ["Information","ISLOGICAL",
  "Checks whether a cell has a logical value of (TRUE or FALSE) and returns TRUE or FALSE"],
 ["Maths And Trigonometry","PRODUCT",
  "Returns the product of multiplying numbers e.g. =PRODUCT(1, 2, 3) is the same as =1x2x3."],
 ["Information","ISBLANK",
  "Checks whether a cell is empty and returns TRUE or FALSE"],
 ["Maths And Trigonometry","ODD",
  "Returns a number rounded up to the nearest odd integer."],
 ["Statistical","STDEV",
  "Calculates the standard deviation or dispersion measure of a set of values around the mean. Uses n-1 as the divisor."]]
